cttodd88/stm32pwm/main.c
#include "user/LCD_STM32F4.h"
#include "user/stm32f4xx_it.h"
#include "user/pwm.h"
#include "user/ts.h"
#include "delays.h"

#include "rtc.h"
//#include "sentinelLogo.h"
#include "img/sentinelLogo2.h"
#include "img/sentinelLogoBW.h"

#include <stdlib.h>

/* Private typedef -----------------------------------------------------------*/
GPIO_InitTypeDef  GPIO_InitStructure;
NVIC_InitTypeDef nvicStructure;

/* Private define ------------------------------------------------------------*/
typedef struct{
    // inputs
    float inVoltage;
    float inCurrent;
    float inPower;
    // outputs
    float outVoltage;
    float outCurrent;
    float outPower;
    float outFreq;
    // temperatures
    float temp1;
    float temp2;
} SENSORS;

typedef struct{
    int state;
    int voltage;
    float current;
    int chargeLevel;
} BATTINFO;

#define DCFLAG 0x10
#define BATTFLAG 0x08
#define TEMPFLAG 0x04
#define OUTFLAG 0x02
#define ONFLAG 0x01

#define GUI_ID_FRAMEWIN0 GUI_ID_USER + 1
/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
//unsigned int TimingDelay=0;
TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
TIM_OCInitTypeDef  TIM_OCInitStructure;
uint16_t CCR1_Val = 300;
uint16_t CCR2_Val = 100;
WM_HWIN hScreen; // main screen window handle
BUTTON_Handle hButtOutput;
BUTTON_Handle hButtCapacity;
PROGBAR_Handle hChargeBar;
FRAMEWIN_Handle hFrame;
SPINBOX_Handle hSpin;
int currentScreen = 0; // tracks current screen
int batteryCap = 18; // battery capacity in Ah
unsigned char homeStatusFlg = DCFLAG | BATTFLAG;

/* Private function prototypes -----------------------------------------------*/
void Delay(unsigned int nTime);
void TimingDelay_Decrement(void);
SENSORS getMeasurement(void);
BATTINFO getBattMeas(void);
void cbWindow(WM_MESSAGE * pMsg);
void cbFrame(WM_MESSAGE * pMsg);
void drawHomeScreen(void);
void drawBattScreen(void);
void drawSysScreen(void);
void drawAboutScreen(void);
void updateDispValues(void);
void drawBatteryCapacity(void);
void setBatteryCapacity(void);

/* Private functions ---------------------------------------------------------*/


//WM_HWIN CreateWindow(void);
//WM_HWIN hDlg;

extern GUI_PID_STATE pstate;

int duty =0;
int index2 = 0;
int lookup[101]={0};

int main(void)
{
    /*Variables*/
    int period = 13999;
    WM_HWIN hMenu; // menu window handle
    WM_HWIN hChild; // frame content window handle
        
    // Button Handles
    BUTTON_Handle hButtonHome;
    BUTTON_Handle hButtonBatt;
    BUTTON_Handle hButtonSys;
    BUTTON_Handle hButtonAbout;
    BUTTON_Handle hButtOK;
    
    /*Initialization*/
    
    SystemInit();
        
    if(SysTick_Config(SystemCoreClock/1000)){
        while(1);
    }
    
    Init_GPIO(); // Ports C,D,E Clocks enabled in here
    //RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

    //period=874;
    genLookup(lookup,100,13999);

    /* Alternating functions for pins */
    //PWM_TIMER_Init(220);  //40Khz 2083
    PWM_TIMER_Init3(period); //500 KHz 166
    //PWM_TIMER_Init8(8399);
    /*
	PWM_InitOC1(83);
    PWM_InitOC2(4199);
    PWM_InitOC3(4199);
    PWM_InitOC4(83);
	*/
    //GPIO_PinAFConfig(GPIOD, GPIO_PinSource12, GPIO_AF_TIM4);
    //GPIO_PinAFConfig(GPIOD, GPIO_PinSource13, GPIO_AF_TIM4);
    //GPIO_PinAFConfig(GPIOD, GPIO_PinSource14, GPIO_AF_TIM4);
    //GPIO_PinAFConfig(GPIOD, GPIO_PinSource15, GPIO_AF_TIM4);
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource8, GPIO_AF_TIM3);
    GPIO_PinAFConfig(GPIOC, GPIO_PinSource9, GPIO_AF_TIM3);
    //GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_TIM1);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8|GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    TIM_ITConfig(TIM3,TIM_IT_Update,ENABLE);
    nvicStructure.NVIC_IRQChannel = TIM3_IRQn;
    nvicStructure.NVIC_IRQChannelPreemptionPriority = 0;
    nvicStructure.NVIC_IRQChannelSubPriority = 1;
    nvicStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&nvicStructure);

    Init_FSMC();
    
    /* Enable the CRC Module */
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_CRC, ENABLE);

    GUI_Init();

    Init_LCD();

    touch_init();

    pwm_init();
    //turn on lcd backlight
    GPIO_ResetBits(GPIOD, GPIO_Pin_12);

    //rtcConfig();

    /*
     * GUI Setup
     */
    // Splash Screen
    /*GUI_SetBkColor(GUI_WHITE);
    GUI_Clear();
    GUI_DrawBitmap(&bmSentinelLogoBW, 60,20);
    DelayMs(2000);*/
    
    // Setup
    GUI_SetFont(&GUI_Font8x16);
    GUI_SetBkColor(GUI_BLACK);
    GUI_Clear();
    GUI_DispString("Sentinel Power");
    
    // create window for menu
    hMenu = WM_CreateWindow(0, 190, 320, 50, WM_CF_SHOW, cbWindow, 0);
    
    // create main window
    GUI_SetBkColor(GUI_DARKBLUE);
    hScreen = WM_CreateWindow(0, 16, 320, 174, WM_CF_SHOW, cbWindow, 0);
    WM_SelectWindow(hScreen);
    GUI_Clear();
    
    /*
     * Draw Menu
     */
    WM_SelectWindow(hMenu);
    
    //Home button
    hButtonHome = BUTTON_CreateEx(0, 0, 80, 50, hMenu, WM_CF_SHOW, 0, GUI_ID_BUTTON0);
    BUTTON_SetFont(hButtonHome, &GUI_Font8x16);
    BUTTON_SetText(hButtonHome, "Home");
    BUTTON_SetFocussable(hButtonHome, 0);
    
    //Battery button
    hButtonBatt = BUTTON_CreateEx(80, 0, 80, 50, hMenu, WM_CF_SHOW, 0, GUI_ID_BUTTON1);
    BUTTON_SetFont(hButtonBatt, &GUI_Font8x16);
    BUTTON_SetText(hButtonBatt, "Battery");
    BUTTON_SetFocussable(hButtonBatt, 0);
    
    //System button
    hButtonSys = BUTTON_CreateEx(160, 0, 80, 50, hMenu, WM_CF_SHOW, 0, GUI_ID_BUTTON2);
    BUTTON_SetFont(hButtonSys, &GUI_Font8x16);
    BUTTON_SetText(hButtonSys, "System");
    BUTTON_SetFocussable(hButtonSys, 0);
    
    //About button
    hButtonAbout = BUTTON_CreateEx(240, 0, 80, 50, hMenu, WM_CF_SHOW, 0, GUI_ID_BUTTON3);
    BUTTON_SetFont(hButtonAbout, &GUI_Font8x16);
    BUTTON_SetText(hButtonAbout, "About");
    BUTTON_SetFocussable(hButtonAbout, 0);
    
    BUTTON_SetDefaultSkin(BUTTON_SKIN_FLEX);
    //HOME SCREEN: Output button
    hButtOutput = BUTTON_CreateEx(180, 106, 116, 50, hScreen, WM_CF_HIDE | WM_CF_DISABLED, 0, GUI_ID_BUTTON4);
    BUTTON_SetFont(hButtOutput, GUI_FONT_20B_ASCII);
    BUTTON_SetText(hButtOutput, "OUTPUT");
    BUTTON_SetFocussable(hButtOutput, 0);
    
