cttodd88/stm32pwm/main.c
/*
 * drawHomeScreen()
 */
void drawHomeScreen(void) {   
    WM_SelectWindow(hScreen);
    WM_ShowWindow(hButtOutput);
    WM_EnableWindow(hButtOutput);
    WM_HideWindow(hButtCapacity);
    WM_DisableWindow(hButtCapacity);
    WM_HideWindow(hChargeBar);
    WM_HideWindow(hFrame);
    
    GUI_Clear();
        
    // indicator BG circles
    GUI_SetColor(GUI_BLACK);
    GUI_FillCircle(20,24,16); // DC Input
    GUI_FillCircle(20,66,16); // Battery
    GUI_FillCircle(20,108,16); // Temperature
    GUI_FillCircle(20,150,16); // Existing Out
    GUI_FillCircle(283,40,32); // On
    GUI_FillCircle(192,40,32); // Off
    
    updateDispValues(); // display current status indicators 
    
    GUI_SetColor(GUI_CYAN);
    GUI_SetFont(&GUI_Font8x16);
    GUI_DispStringAt("DC Input", 44, 16);
    GUI_DispStringAt("Battery", 44, 58);
    GUI_DispStringAt("Temperature", 44, 100);
    GUI_DispStringAt("Existing Out", 44, 142);
    GUI_DispStringAt("ON", 276, 76);
    GUI_DispStringAt("OFF", 181, 76);
    
}

/*
 * drawSysScreen()
 * desc: displays system sensor information
 */
void drawSysScreen(void) {
    WM_SelectWindow(hScreen);
    WM_HideWindow(hButtOutput);
    WM_DisableWindow(hButtOutput);
    WM_HideWindow(hButtCapacity);
    WM_DisableWindow(hButtCapacity);
    WM_HideWindow(hChargeBar);
    WM_HideWindow(hFrame);
    GUI_Clear();
    
    SENSORS meas = getMeasurement();
    
    // Input/Output dividing line
    GUI_SetColor(GUI_DARKCYAN);    
    GUI_FillRect(159, 4, 160, 113);
    GUI_FillRect(3, 118, 316, 119);
    
    GUI_SetColor(GUI_CYAN);
    GUI_SetFont(&GUI_Font8x16);
    GUI_GotoXY(60,16);
    GUI_DispString("INPUT");
    GUI_GotoX(216);
    GUI_DispString("OUTPUT\n\n");
    
    // Input Voltage
    GUI_DispString("Voltage: ");
    GUI_DispFloat(meas.inVoltage, 6);
    GUI_DispString(" V");
    
    // Output Voltage
    GUI_GotoX(162);
    GUI_DispString("Voltage: ");
    GUI_DispFloat(meas.outVoltage, 6);
    GUI_DispString(" V\n");
    
    // Input Current
    GUI_DispString("Current: ");
    GUI_DispFloat(meas.inCurrent, 6);
    GUI_DispString(" A");
    
    // Output Current
    GUI_GotoX(162);
    GUI_DispString("Current: ");
    GUI_DispFloat(meas.outCurrent, 6);
    GUI_DispString(" A\n");
    
    // Input Power
    GUI_DispString("Power: ");
    GUI_DispFloat(meas.inPower, 6);
    GUI_DispString(" W");
    
    // Output Power
    GUI_GotoX(162);
    GUI_DispString("Power: ");
    GUI_DispFloat(meas.outPower, 6);
    GUI_DispString(" W\n");
    
    // Output Frequency
    GUI_GotoX(162);
    GUI_DispString("Frequency: ");
    GUI_DispFloat(meas.outFreq, 6);
    GUI_DispString(" Hz\n\n");
    
    // Temperature Readings
    GUI_DispString("Temperature1: ");
    GUI_DispFloat(meas.temp1, 6);
    GUI_DispChar(' ');
    GUI_DispChar(176); // degree sign
    GUI_DispString("C\n");
    GUI_DispString("Temperature2: ");
    GUI_DispFloat(meas.temp2, 6);
    GUI_DispChar(' ');
    GUI_DispChar(176); // degree sign
    GUI_DispChar('C');
    
    // Set Back Color back to default
    GUI_SetBkColor(GUI_DARKBLUE);
}

/*
 * drawBattScreen()
 */
void drawBattScreen(void) {
    WM_SelectWindow(hScreen);
    WM_HideWindow(hButtOutput);
    WM_DisableWindow(hButtOutput);
    WM_ShowWindow(hButtCapacity);
    WM_EnableWindow(hButtCapacity);
    WM_ShowWindow(hChargeBar);
    GUI_Clear();
    
    BATTINFO m = getBattMeas();
       
    PROGBAR_SetValue(hChargeBar, m.chargeLevel);
    //GUI_DispStringAt("72%", 228, 16);    
    
    GUI_SetColor(GUI_CYAN);
    GUI_SetFont(&GUI_Font8x16);
    //GUI_GotoXY(0,16);
    
    GUI_GotoXY(228, 16);
    GUI_DispDec(m.chargeLevel, 2);
    GUI_DispChar('%');
    //GUI_DispStringAt("72%", 228, 16);
    if(m.state){
        GUI_DispStringAt("State: Charging\n", 0, 16);
    }
    else {
        GUI_DispStringAt("State: Discharging\n", 0, 16);
    }
    GUI_DispString("Voltage: ");
    GUI_DispDec(m.voltage, 2);
    GUI_DispString(" V\n");
    GUI_DispString("Current: ");
    GUI_DispFloat(m.current, 3);
    GUI_DispString(" A\n\n");
    GUI_DispString("Capacity: ");
    GUI_DispDec(batteryCap, 2);
    GUI_DispString(" Ah");
}

/*
 * drawAboutScreen()
 * desc: display team logo and version info
 */
void drawAboutScreen(void) {
    WM_SelectWindow(hScreen);
    WM_HideWindow(hButtOutput);
    WM_DisableWindow(hButtOutput);
    WM_HideWindow(hButtCapacity);
    WM_DisableWindow(hButtCapacity);
    WM_HideWindow(hChargeBar);
    WM_HideWindow(hFrame);
    GUI_Clear();
    
    GUI_DrawBitmap(&bmSentinelLogo2, 12, 12);
    
    GUI_SetColor(GUI_CYAN);
    GUI_SetFont(GUI_FONT_32B_ASCII);
    
    GUI_GotoXY(174, 12);
    GUI_DispString("Sentinel\n");
    GUI_GotoX(174);
    GUI_DispString("Power\n");
    GUI_SetFont(GUI_FONT_13B_ASCII);
    GUI_GotoXY(174, 123);
    GUI_DispString("Firmware Version 0.1");
    
    GUI_GotoXY(174, 149);
    GUI_DispString("STemWin v");
    GUI_DispString(GUI_GetVersionString());
}

/*
 * drawBatteryCapacity()
 * Shows the frame for user input of battery capacity
 */
void drawBatteryCapacity(void) {
    WM_DisableWindow(hButtCapacity);
    SPINBOX_SetValue(hSpin, batteryCap);
    WM_SelectWindow(hFrame);
    WM_ShowWindow(hFrame);
    WM_SetFocus(hFrame);
}

/*
 * setBatteryCapacity()
 * Writes the input value to the variable and hides the input frame
 */
void setBatteryCapacity(void) {
    batteryCap = SPINBOX_GetValue(hSpin);
    WM_SelectWindow(hScreen);
    WM_HideWindow(hFrame);
    WM_HideWindow(hButtCapacity);
    
    GUI_Clear();
    drawBattScreen();
}

/*
 * updateDispValues()
 * Refreshes current screen with updated values
 */
void updateDispValues(void){
    SENSORS m = getMeasurement();
    BATTINFO b = getBattMeas(); 
    
    switch(currentScreen){
        case 0:
            // home screen
            if(homeStatusFlg & DCFLAG) {
                GUI_SetColor(GUI_GREEN);
            }
            else {
                GUI_SetColor(GUI_RED);
            }
            GUI_FillCircle(20,24,12); // DC Input

            if(homeStatusFlg & BATTFLAG) {
                GUI_SetColor(GUI_GREEN);
            }
            else {
                GUI_SetColor(GUI_RED);
            }
            GUI_FillCircle(20,66,12); // Battery

            if(homeStatusFlg & TEMPFLAG) {
                GUI_SetColor(GUI_GREEN);
            }
            else {
                GUI_SetColor(GUI_RED);
            }
            GUI_FillCircle(20,108,12); // Temperature

            if(homeStatusFlg & OUTFLAG) {
                GUI_SetColor(GUI_GREEN);
            }
            else {
                GUI_SetColor(GUI_DARKGRAY);
            }
            GUI_FillCircle(20,150,12); // Existing Out

            if(homeStatusFlg & ONFLAG) {
                GUI_SetColor(GUI_GREEN);
                GUI_FillCircle(283,40,27); // On
                GUI_SetColor(GUI_DARKGRAY);
                GUI_FillCircle(192,40,27); // Off
            } else {
                GUI_SetColor(GUI_DARKGRAY);
                GUI_FillCircle(283,40,27); // On
                GUI_SetColor(GUI_RED);
                GUI_FillCircle(192,40,27); // Off
            }
            break;
            
        case 1:
            // battery screen
            WM_SelectWindow(hScreen);
            
            GUI_GotoXY(228,16);
            GUI_DispDec(b.chargeLevel, 2);
            GUI_GotoXY(56,16);
            if(b.state) {
                GUI_DispString("Charging   ");
            }
            else {
                GUI_DispString("Discharging");
            }
            GUI_GotoXY(72,32);
            GUI_DispDec(b.voltage, 2);
            GUI_GotoXY(72,48);
            GUI_DispFloat(b.current, 3);
            GUI_GotoXY(80,80);
            GUI_DispDec(batteryCap, 2);
            break;
            
        case 2:
            // system screen
            // inputs
            GUI_GotoXY(72,48);
            GUI_DispFloat(m.inVoltage, 6);
            GUI_GotoXY(72,64);
            GUI_DispFloat(m.inCurrent, 6);
            GUI_GotoXY(56,80);
            GUI_DispFloat(m.inPower, 6);
            // outputs
            GUI_GotoXY(234,48);
            GUI_DispFloat(m.outVoltage, 6);
            GUI_GotoXY(234,64);
            GUI_DispFloat(m.outCurrent, 6);
            GUI_GotoXY(218,80);
            GUI_DispFloat(m.outPower, 6);
            GUI_GotoXY(250,96);
            GUI_DispFloat(m.outFreq, 6);
            // temperatures
            GUI_GotoXY(112,128);
            GUI_DispFloat(m.temp1, 6);
            GUI_GotoXY(112,144);
            GUI_DispFloat(m.temp2, 6);
            break;
        
        case 3:
            // about screen
            // nothing to update
            break;
            
        default:
            break;
    }
}
